# Metadata

```{yaml}
Course:   DS 5001 
Module:   02 Text Models
Topic:    Text into Data: Importing a Text, or, Clip, Chunk, and Split
Author:   R.C. Alvarado
```
**Purpose**:  Demonstrate how to tokenize a raw text and map an OHCO onto the resulting dataframe of tokens.

# Set Up

In [36]:
import pandas as pd

In [37]:
data_home = "../data"

In [38]:
text_file = f"{data_home}/gutenberg/pg105.txt"
csv_file = f"{data_home}/output/austen-persuasion.csv" # The file we will create

In [39]:
OHCO = ['chap_num', 'para_num', 'sent_num', 'token_num']

# Import file into a dataframe

In [40]:
LINES = pd.DataFrame(open(text_file, 'r', encoding='utf-8-sig').readlines(), columns=['line_str'])
LINES.index.name = 'line_num'
LINES.line_str = LINES.line_str.str.replace(r'\n+', ' ', regex=True).str.strip()

In [41]:
LINES.sample(20)

                                                   line_str
line_num
1368      well, if it were not for Mary's interference,"...
7347      opposite interest, she calmly said, "Yes, it i...
6200      were reclaimed and repossessed, and another ho...
4955      The visit was paid, their acquaintance re-esta...
8216      truth; and if such parties succeed, how should...
1709      morrow--actually on the morrow; and he had pro...
7688      do not forget you as soon as you forget us.  I...
4641      certainly without the smallest suspicion of hi...
3737      same.  She, however, was soon persuaded to thi...
2903
3369           wish we had such a neighbour at Uppercross."
6735      sensible, careful, discerning sort of characte...
4267      would very soon see no deficiency in his manner."
960
1240      "Where shall we go?" said she, when they were ...
7500      audibly.  "I do not wonder Captain Wentworth i...
2363      Croft were generally out of doors together, in...
2212                 of ladies anywhere, if I can help it."
3869      of returning in the same carriage to Lyme; and...
8046      He found too late, in short, that he had entan...

# Extract Title

In [42]:
title = LINES.loc[0].line_str.replace('The Project Gutenberg EBook of ', '')

In [43]:
print(title)

Persuasion, by Jane Austen

# Clip Cruft

In [44]:
clip_pats = [
    r"\*\*\*\s*START OF (?:THE|THIS) PROJECT",
    r"\*\*\*\s*END OF (?:THE|THIS) PROJECT"
]

In [45]:
pat_a = LINES.line_str.str.match(clip_pats[0])
pat_b = LINES.line_str.str.match(clip_pats[1])

In [46]:
line_a = LINES.loc[pat_a].index[0] + 1
line_b = LINES.loc[pat_b].index[0] - 1

In [47]:
line_a, line_b

(19, 8372)

In [48]:
LINES = LINES.loc[line_a : line_b]

In [49]:
LINES.head(10)

                                                   line_str
line_num
19
20
21
22
23        Produced by Sharon Partridge and Martin Ward. ...
24                                            by Al Haines.
25
26
27
28

In [50]:
LINES.tail(10)

                                                   line_str
line_num
8363
8364
8365
8366
8367
8368
8369
8370
8371      End of the Project Gutenberg EBook of Persuasi...
8372

# Chunk by chapter

## Find all chapter headers

The regex will depend on the source text. You need to investigate the source text to figure this out.

In [51]:
chap_pat = r"^\s*(?:chapter|letter)\s+\d+"

In [52]:
chap_lines = LINES.line_str.str.match(chap_pat, case=False) # Returns a truth vector

In [53]:
LINES.loc[chap_lines] # Use as filter for dataframe

            line_str
line_num
47         Chapter 1
306        Chapter 2
500        Chapter 3
786        Chapter 4
959        Chapter 5
1297       Chapter 6
1657       Chapter 7
1992       Chapter 8
2346       Chapter 9
2632      Chapter 10
3020      Chapter 11
3314      Chapter 12
3876      Chapter 13
4150      Chapter 14
4409      Chapter 15
4677      Chapter 16
4912      Chapter 17
5248      Chapter 18
5654      Chapter 19
5905      Chapter 20
6265      Chapter 21
6970      Chapter 22
7555      Chapter 23
8208      Chapter 24

## Assign numbers to chapters

In [54]:
LINES.loc[chap_lines, 'chap_num'] = [i+1 for i in range(LINES.loc[chap_lines].shape[0])]

In [55]:
LINES.loc[chap_lines]

            line_str  chap_num
line_num
47         Chapter 1       1.0
306        Chapter 2       2.0
500        Chapter 3       3.0
786        Chapter 4       4.0
959        Chapter 5       5.0
1297       Chapter 6       6.0
1657       Chapter 7       7.0
1992       Chapter 8       8.0
2346       Chapter 9       9.0
2632      Chapter 10      10.0
3020      Chapter 11      11.0
3314      Chapter 12      12.0
3876      Chapter 13      13.0
4150      Chapter 14      14.0
4409      Chapter 15      15.0
4677      Chapter 16      16.0
4912      Chapter 17      17.0
5248      Chapter 18      18.0
5654      Chapter 19      19.0
5905      Chapter 20      20.0
6265      Chapter 21      21.0
6970      Chapter 22      22.0
7555      Chapter 23      23.0
8208      Chapter 24      24.0

Notice that all lines that are not chapter headers have no chapter number assigned to them.

In [56]:
LINES.sample(10)

                                                   line_str  chap_num
line_num
724       fact; and afterwards, contrary to my judgement...       NaN
956                                                               NaN
5260                                                              NaN
4596      or a cap, would not be liable to any such misu...       NaN
3827      general, his voice and manner were studiously ...       NaN
1939      her as he would.  No:  the years which had des...       NaN
4617      looked completely astonished, but not more ast...       NaN
6401      I am not going to marry Mr Elliot.  I should l...       NaN
5026      the right time for applying.  Everybody's hear...       NaN
7480      were laid on the table, with a courteous, comp...       NaN

## Forward-fill chapter numbers to following text lines

`ffill()` will replace null values with the previous non-null value.

In [57]:
LINES.chap_num = LINES.chap_num.ffill()

In [58]:
LINES.sample(10)

                                                   line_str  chap_num
line_num
316                                                               2.0
1789      "But, could you be comfortable yourself, to be...       7.0
5899                                                             19.0
1710      manner, as if he felt all the motive of their ...       7.0
3141      and the account which Captain Wentworth had gi...      11.0
1703      him, how much handsomer, how infinitely more a...       7.0
3354      into the subject, as ready to do good by enter...      12.0
5325                                                             18.0
6910                                                             21.0
2348                                                              9.0

Notice that the lines taht precede our first chapter have no chapters, which is what we want. We need to decide whether to keep these lines as textual front matter or to dispose of them.

In [59]:
LINES.head(20)

                                                   line_str  chap_num
line_num
19                                                                NaN
20                                                                NaN
21                                                                NaN
22                                                                NaN
23        Produced by Sharon Partridge and Martin Ward. ...       NaN
24                                            by Al Haines.       NaN
25                                                                NaN
26                                                                NaN
27                                                                NaN
28                                                                NaN
29                                                                NaN
30                                                                NaN
31                                                                NaN
32                                                                NaN
33                                                                NaN
34                                                                NaN
35                                               Persuasion       NaN
36                                                                NaN
37                                                                NaN
38                                                       by       NaN

## Clean up

In [60]:
LINES = LINES.dropna(subset=['chap_num']) # Remove everything before Chapter 1
# LINES = LINES.loc[~LINES.chap_num.isna()] # Remove everything before Chapter 1 (alternate method)
LINES = LINES.loc[~chap_lines] # Remove chapter heading lines; their work is done
LINES.chap_num = LINES.chap_num.astype('int') # Convert chap_num from float to int

In [61]:
LINES.sample(10)

                                                   line_str  chap_num
line_num
174       Elizabeth did not quite equal her father in pe...         1
5011      in good hands.  She had seen too much of the w...        17
5780      together, her arm under his, a gentle and emba...        19
5820      meant to be in Bath; he had not mentioned it, ...        19
373       highly; and as to the severe degree of self-de...         2
6674      intimacy.  I have now another motive for being...        21
4490      had, at his own particular request, been admit...        15
8033      "I found," said he, "that I was considered by ...        23
3064      hours.  His acquittal was complete, his friend...        11
3266      besides the persuasion of having given him at ...        11

## Group lines into chapters

In [62]:
OHCO[:1]

['chap_num']

In [63]:
# Make big string for each chapter
CHAPS = LINES.groupby(OHCO[:1])\
    .line_str.apply(lambda x: '\n'.join(x))\
    .to_frame('chap_str')

In [64]:
CHAPS.head(10)

                                                   chap_str
chap_num
1         \n\nSir Walter Elliot, of Kellynch Hall, in So...
2         \n\nMr Shepherd, a civil, cautious lawyer, who...
3         \n\n"I must take leave to observe, Sir Walter,...
4         \n\nHe was not Mr Wentworth, the former curate...
5         \n\nOn the morning appointed for Admiral and M...
6         \n\nAnne had not wanted this visit to Uppercro...
7         \n\nA very few days more, and Captain Wentwort...
8         \n\nFrom this time Captain Wentworth and Anne ...
9         \n\nCaptain Wentworth was come to Kellynch as ...
10        \n\nOther opportunities of making her observat...

In [65]:
CHAPS['chap_str'] = CHAPS.chap_str.str.strip()

In [67]:
CHAPS

                                                   chap_str
chap_num
1         Sir Walter Elliot, of Kellynch Hall, in Somers...
2         Mr Shepherd, a civil, cautious lawyer, who, wh...
3         "I must take leave to observe, Sir Walter," sa...
4         He was not Mr Wentworth, the former curate of ...
5         On the morning appointed for Admiral and Mrs C...
6         Anne had not wanted this visit to Uppercross, ...
7         A very few days more, and Captain Wentworth wa...
8         From this time Captain Wentworth and Anne Elli...
9         Captain Wentworth was come to Kellynch as to a...
10        Other opportunities of making her observations...
11        The time now approached for Lady Russell's ret...
12        Anne and Henrietta, finding themselves the ear...
13        The remainder of Anne's time at Uppercross, co...
14        Though Charles and Mary had remained at Lyme m...
15        Sir Walter had taken a very good house in Camd...
16        There was one point which Anne, on returning t...
17        While Sir Walter and Elizabeth were assiduousl...
18        It was the beginning of February; and Anne, ha...
19        While Admiral Croft was taking this walk with ...
20        Sir Walter, his two daughters, and Mrs Clay, w...
21        Anne recollected with pleasure the next mornin...
22        Anne went home to think over all that she had ...
23        One day only had passed since Anne's conversat...
24        Who can be in doubt of what followed?  When an...

So, now we have our text grouped by chapters.

# Split chapters into paragraphs 

We use Pandas' convenient `.split()` method with `expand=True`, followed by `.stack()`.
Note that this creates zero-based indexes.

In [68]:
para_pat = r'\n\n+'

In [69]:
# CHAPS['chap_str'].str.split(para_pat, expand=True).head()

In [70]:
PARAS = CHAPS['chap_str'].str.split(para_pat, expand=True).stack()\
    .to_frame('para_str').sort_index()
PARAS.index.names = OHCO[:2]

In [71]:
PARAS.head()

                                                            para_str
chap_num para_num
1        0         Sir Walter Elliot, of Kellynch Hall, in Somers...
         1                                 "ELLIOT OF KELLYNCH HALL.
         2         "Walter Elliot, born March 1, 1760, married, J...
         3         Precisely such had the paragraph originally st...
         4         Then followed the history and rise of the anci...

In [72]:
PARAS['para_str'] = PARAS['para_str'].str.replace(r'\n', ' ', regex=True)
PARAS['para_str'] = PARAS['para_str'].str.strip()
PARAS = PARAS[~PARAS['para_str'].str.match(r'^\s*$')] # Remove empty paragraphs

In [73]:
PARAS.head()

                                                            para_str
chap_num para_num
1        0         Sir Walter Elliot, of Kellynch Hall, in Somers...
         1                                 "ELLIOT OF KELLYNCH HALL.
         2         "Walter Elliot, born March 1, 1760, married, J...
         3         Precisely such had the paragraph originally st...
         4         Then followed the history and rise of the anci...

# Split paragraphs into sentences

In [74]:
# sent_pat = r'[.?!;:"]+'
sent_pat = r'[.?!;:]+'
SENTS = PARAS['para_str'].str.split(sent_pat, expand=True).stack()\
    .to_frame('sent_str')
SENTS.index.names = OHCO[:3]

In [75]:
SENTS = SENTS[~SENTS['sent_str'].str.match(r'^\s*$')] # Remove empty paragraphs
SENTS.sent_str = SENTS.sent_str.str.strip() # CRUCIAL TO REMOVE BLANK TOKENS

In [76]:
SENTS.head()

                                                                     sent_str
chap_num para_num sent_num
1        0        0         Sir Walter Elliot, of Kellynch Hall, in Somers...
                  1         there he found occupation for an idle hour, an...
                  2         there his faculties were roused into admiratio...
                  3         there any unwelcome sensations, arising from d...
                  4         and there, if every other leaf were powerless,...

# Split sentences into tokens

In [77]:
token_pat = r"[\s',-]+"
TOKENS = SENTS['sent_str'].str.split(token_pat, expand=True).stack()\
    .to_frame('token_str')

In [78]:
TOKENS.index.names = OHCO[:4]

In [79]:
TOKENS

                                       token_str
chap_num para_num sent_num token_num
1        0        0        0                 Sir
                           1              Walter
                           2              Elliot
                           3                  of
                           4            Kellynch
...                                          ...
24       13       0        6                  of
                           7          Persuasion
                           8                  by
                           9                Jane
                           10             Austen

[85014 rows x 1 columns]

# Extract Vocabulary

In [44]:
TOKENS['term_str'] = TOKENS.token_str.replace(r'[\W_]+', '', regex=True).str.lower()
VOCAB = TOKENS.term_str.value_counts().to_frame('n').reset_index().rename(columns={'index':'term_str'})
VOCAB.index.name = 'term_id'

In [45]:
VOCAB

            term_str     n
term_id
0                the  3330
1                 to  2808
2                and  2800
3                 of  2572
4                  a  1595
...              ...   ...
5755           reins     1
5756     judiciously     1
5757             rut     1
5758            dung     1
5759          austen     1

[5760 rows x 2 columns]

# Gathering by Content Object

In [46]:
def gather(ohco_level):
    global TOKENS
    level_name = OHCO[ohco_level-1].split('_')[0]
    df = TOKENS.groupby(OHCO[:ohco_level])\
        .token_str.apply(lambda x: x.str.cat(sep=' '))\
        .to_frame(f"{level_name}_str")
    return df

In [47]:
gather(1)

                                                   chap_str
chap_num
1         Sir Walter Elliot of Kellynch Hall in Somerset...
2         Mr Shepherd a civil cautious lawyer who whatev...
3         "I must take leave to observe Sir Walter " sai...
4         He was not Mr Wentworth the former curate of M...
5         On the morning appointed for Admiral and Mrs C...
6         Anne had not wanted this visit to Uppercross t...
7         A very few days more and Captain Wentworth was...
8         From this time Captain Wentworth and Anne Elli...
9         Captain Wentworth was come to Kellynch as to a...
10        Other opportunities of making her observations...
11        The time now approached for Lady Russell s ret...
12        Anne and Henrietta finding themselves the earl...
13        The remainder of Anne s time at Uppercross com...
14        Though Charles and Mary had remained at Lyme m...
15        Sir Walter had taken a very good house in Camd...
16        There was one point which Anne on returning to...
17        While Sir Walter and Elizabeth were assiduousl...
18        It was the beginning of February and Anne havi...
19        While Admiral Croft was taking this walk with ...
20        Sir Walter his two daughters and Mrs Clay were...
21        Anne recollected with pleasure the next mornin...
22        Anne went home to think over all that she had ...
23        One day only had passed since Anne s conversat...
24        Who can be in doubt of what followed When any ...

In [48]:
gather(2)

                                                            para_str
chap_num para_num
1        0         Sir Walter Elliot of Kellynch Hall in Somerset...
         1                                  "ELLIOT OF KELLYNCH HALL
         2         "Walter Elliot born March 1 1760 married July ...
         3         Precisely such had the paragraph originally st...
         4         Then followed the history and rise of the anci...
...                                                              ...
24       9         Anne satisfied at a very early period of Lady ...
         10        Her recent good offices by Anne had been enoug...
         11        Mrs Smith s enjoyments were not spoiled by thi...
         12                                                    Finis
         13        End of the Project Gutenberg EBook of Persuasi...

[1008 rows x 1 columns]

In [49]:
gather(3)

                                                                     sent_str
chap_num para_num sent_num
1        0        0         Sir Walter Elliot of Kellynch Hall in Somerset...
                  1         there he found occupation for an idle hour and...
                  2         there his faculties were roused into admiratio...
                  3         there any unwelcome sensations arising from do...
                  4         and there if every other leaf were powerless h...
...                                                                       ...
24       11       4         Anne was tenderness itself and she had the ful...
                  5         His profession was all that could ever make he...
                  6         She gloried in being a sailor s wife but she m...
         12       0                                                     Finis
         13       0         End of the Project Gutenberg EBook of Persuasi...

[5612 rows x 1 columns]

# Save work to CSV

This is important -- will be used for homework.

In [50]:
TOKENS.to_csv(csv_file)

# Use Library

In [51]:
import sys
sys.path.append("../lib")
from textimporter import TextImporter

In [52]:
pg105 = TextImporter(src_file=text_file, ohco_pats=[('chap', chap_pat, 'm')], clip_pats=clip_pats)
pg105.import_source()
pg105.parse_tokens()
pg105.extract_vocab()

Importing  ../data/gutenberg/pg105.txt
Clipping text
Parsing OHCO level 0 chap_id by milestone ^\s*(?:chapter|letter)\s+\d+
Parsing OHCO level 1 para_num by delimitter \n\n
Parsing OHCO level 2 sent_num by delimitter [.?!;:]+
Parsing OHCO level 3 token_num by delimitter [\s',-]+

In [53]:
pg105.TOKENS

                                      token_str    term_str
chap_id para_num sent_num token_num
1       0        0        0                 Sir         sir
                          1              Walter      walter
                          2              Elliot      elliot
                          3                  of          of
                          4            Kellynch    kellynch
...                                         ...         ...
24      17       0        7                  of          of
                          8          Persuasion  persuasion
                          9                  by          by
                          10               Jane        jane
                          11             Austen      austen

[84904 rows x 2 columns]

In [54]:
pg105.VOCAB

                n  n_chars         p             s          i         h
term_str
the          3330        3  0.039221     25.496697   4.672238  0.183249
to           2808        2  0.033073     30.236467   4.918218  0.162658
and          2800        3  0.032978     30.322857   4.922334  0.162331
of           2572        2  0.030293     33.010886   5.044870  0.152824
a            1595        1  0.018786     53.231348   5.734204  0.107722
...           ...      ...       ...           ...        ...       ...
reins           1        5  0.000012  84904.000000  16.373545  0.000193
judiciously     1       11  0.000012  84904.000000  16.373545  0.000193
rut             1        3  0.000012  84904.000000  16.373545  0.000193
dung            1        4  0.000012  84904.000000  16.373545  0.000193
austen          1        6  0.000012  84904.000000  16.373545  0.000193

[5760 rows x 6 columns]